from models import Trip


# Данные для подключения к MySQL
class UserDB:
	def __init__(self, hostname, username, password, database):
		self.hostname = hostname
		self.username = username
		self.password = password
		self.database = database
pyConDB = UserDB('localhost', 'python', 'python3141', 'trip')

# host_name = 'localhost'
# user_name = 'python_server'
# password_python = 'QWErty123%%123_123'
# database_name = 'http_server_users'

##########################################################################################

admName = '111' # Юзернейм админа
admPass = '111' # Пароль админа

##########################################################################################

directoryName = 'Source' # Имя каталога для фронтенда
mainPageName = 'index.html' # Имя стартовой страницы

citiesScheme = [
['m', 'Москва'],
['n', 'Нижний Новгород'],
['s', 'Санкт-Петербург'],
['z', 'Казань'],
['o', 'Кострома'],
['r', 'Ярославль'],
['i', 'Иваново'],
['v', 'Воронеж'],
['e', 'Екатеринбург'],
['u', 'Муром']
]

# Временная БД
tripList = [
	Trip('01', 'Москва', 'Нижний Новгород', '2023-06-01', '09:45', '2000', '11111001011000010100', '10', '2'),
	Trip('02', 'Санкт-Петербург', 'Москва', '2023-06-01', '09:45', '3000', '00001100000000111101', '14', '3'),
	Trip('03', 'Москва', 'Санкт-Петербург', '2023-06-01', '14:00', '3000', '11111001011000010100', '11', '1'),
	Trip('04', 'Нижний Новгород', 'Москва', '2023-06-01', '17:30', '2000', '00001100000000111101', '12', '2'),
	Trip('05', 'Санкт-Петербург', 'Москва', '2023-06-02', '09:45', '3000', '00001100000000111101', '14', '1'),
	Trip('06', 'Москва', 'Нижний Новгород', '2023-06-02', '14:00', '2000', '11111001011000010100', '10', '3'),
	Trip('07', 'Нижний Новгород', 'Санкт-Петербург', '2023-06-02', '14:00', '4000', '00001100000000111101', '13', '2'),
	Trip('08', 'Санкт-Петербург', 'Нижний Новгород', '2023-06-03', '09:45', '4000', '11111001011000010100', '15', '1'),
	Trip('09', 'Санкт-Петербург', 'Москва', '2023-06-03', '09:45', '3000', '00001100000000111101', '14', '3'),
	Trip('10', 'Москва', 'Нижний Новгород', '2023-06-03', '17:30', '2000', '11111001011000010100', '10', '3'),
	Trip('11', 'Нижний Новгород', 'Москва', '2023-06-03', '17:30', '2000', '00001100000000111101', '12', '2'),
	Trip('12', 'Москва', 'Нижний Новгород', '2023-06-04', '14:00', '2000', '11111001011000010100', '10', '2'),
	Trip('13', 'Санкт-Петербург', 'Москва', '2023-06-04', '17:30', '3000', '00001100000000111101', '14', '1'),
	Trip('14', 'Москва', 'Нижний Новгород', '2023-06-05', '09:45', '2000', '11111001011000010100', '10', '3'),
	Trip('15', 'Санкт-Петербург', 'Нижний Новгород', '2023-06-05', '09:45', '4000', '00001100000000111101', '15', '1'),
	Trip('16', 'Нижний Новгород', 'Москва', '2023-06-05', '17:30', '2000', '11111001011000010100', '12', '1'),
	Trip('17', 'Санкт-Петербург', 'Москва', '2023-06-06', '09:45', '3000', '00001100000000111101', '14', '1'),
	Trip('18', 'Москва', 'Нижний Новгород', '2023-06-06', '17:30', '2000', '11111001011000010100', '10', '2'),
	Trip('19', 'Нижний Новгород', 'Москва', '2023-06-06', '17:30', '2000', '00001100000000111101', '12', '3'),
	Trip('20', 'Москва', 'Нижний Новгород', '2023-06-07', '14:00', '2000', '11111001011000010100', '10', '2'),
	Trip('21', 'Санкт-Петербург', 'Москва', '2023-06-07', '14:00', '3000', '00001100000000111101', '14', '3'),
	Trip('22', 'Нижний Новгород', 'Санкт-Петербург', '2023-06-07', '17:30', '4000', '11111001011000010100', '13', '1'),
	Trip('23', 'Москва', 'Санкт-Петербург', '2023-06-07', '17:30', '3000', '00001100000000111101', '11', '2'),
	Trip('24', 'Нижний Новгород', 'Санкт-Петербург', '2023-06-08', '09:45', '4000', '11111001011000010100', '13', '2'),
	Trip('25', 'Москва', 'Санкт-Петербург', '2023-06-08', '09:45', '3000', '00001100000000111101', '11', '3'),
	Trip('26', 'Москва', 'Нижний Новгород', '2023-06-08', '17:30', '2000', '11111001011000010100', '10', '1'),
	Trip('27', 'Санкт-Петербург', 'Москва', '2023-06-09', '09:45', '3000', '00001100000000111101', '14', '1'),
	Trip('28', 'Москва', 'Нижний Новгород', '2023-06-09', '14:00', '2000', '11111001011000010100', '10', '2'),
	Trip('29', 'Нижний Новгород', 'Москва', '2023-06-09', '14:00', '2000', '00001100000000111101', '12', '1'),
	Trip('30', 'Москва', 'Санкт-Петербург', '2023-06-09', '17:30', '3000', '11111001011000010100', '11', '3'),
]